Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ICentralLockedCallback GetLockCallback()
  Visual Basic
Public Function GetLockCallback As ICentralLockedCallback
  Visual C++
public:
ICentralLockedCallback^ GetLockCallback()
 See Also
  TransactWithCentralOptions Class
  Autodesk.Revit.DB Namespace